{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.3", "config": [{"class_name": "Conv1D", "config": {"use_bias": true, "kernel_constraint": null, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3], "name": "conv1d_1", "bias_regularizer": null, "trainable": true, "padding": "same", "activation": "relu", "activity_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "uniform"}}, "batch_input_shape": [null, 60, 32], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [1], "dilation_rate": [1]}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "padding": "valid", "strides": [2], "pool_size": [2], "name": "max_pooling1d_1"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "trainable": true, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "GRU", "config": {"unroll": false, "use_bias": true, "dropout": 0.0, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "gru_1", "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "stateful": false, "go_backwards": false, "recurrent_regularizer": null, "return_state": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "recurrent_dropout": 0.0, "units": 100, "bias_regularizer": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "implementation": 1, "kernel_regularizer": null, "return_sequences": true, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "trainable": true, "noise_shape": null, "name": "dropout_2"}}, {"class_name": "GRU", "config": {"unroll": false, "use_bias": true, "dropout": 0.0, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "gru_2", "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "stateful": false, "go_backwards": false, "recurrent_regularizer": null, "return_state": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "recurrent_dropout": 0.0, "units": 100, "bias_regularizer": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "implementation": 1, "kernel_regularizer": null, "return_sequences": false, "activation": "tanh"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "name": "dense_1", "bias_regularizer": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}}]}